Fuzzzies/esp32-nuts/sdkconfig.defaults
# esp32-nuts — common build defaults (ESP32-S2FN4R2: 4MB flash, 2MB in-package PSRAM)
CONFIG_IDF_TARGET="esp32s2"

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# In-package PSRAM (the R2 in S2FN4R2)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

CONFIG_FREERTOS_HZ=1000

# Roomier HTTP request headers (some browsers send a lot)
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
